{"backend": "tensorflow", "keras_version": "2.0.6", "config": [{"config": {"trainable": true, "mask_value": 0.0, "batch_input_shape": [null, 7000, 88], "dtype": "float32", "name": "masking_1"}, "class_name": "Masking"}, {"config": {"stateful": false, "trainable": true, "activation": "tanh", "units": 200, "activity_regularizer": null, "unroll": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": true, "dropout": 0.2, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_regularizer": null, "implementation": 0, "unit_forget_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "recurrent_dropout": 0.0, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_constraint": null, "return_state": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "layer": {"config": {"kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, "name": "time_distributed_1"}, "class_name": "TimeDistributed"}, {"config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential"}