{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Masking", "config": {"name": "masking_1", "mask_value": 0.0, "batch_input_shape": [null, 7000, 88], "trainable": true, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "lstm_1", "recurrent_constraint": null, "dropout": 0.2, "trainable": true, "units": 200, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "implementation": 0, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "unroll": false, "unit_forget_bias": true, "stateful": false, "activation": "tanh", "bias_constraint": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "activation": "linear", "units": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}], "keras_version": "2.0.6"}